In [1]:
import pymongo
from pymongo import MongoClient
client = MongoClient('mongodb://localhost:27017/')

In [2]:
#This will create a Collection/Database called department if it doesn't already exist
coll_department = client['department']
department = coll_department.department

In [4]:
#Inserts department names and heads data
department.insert_many([{"dep_name": "IT", "DepartmentHead":"Jason"},
                            {"dep_name": "Admin", "DepartmentHead":"Nial"},
                            {"dep_name": "Accounts", "DepartmentHead":"Harris"},
                       {"dep_name": "Analysis", "DepartmentHead":"Jack"}])

In order to create the data we will pandas dataframe. A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

In [5]:
#This will create a Collection/Database called employees if it doesn't already exist

import pandas as pd
db = client['employees']
df_employees = pd.DataFrame(list(db.employees.find()))

In [6]:
df_employees.head()

                        _id     name Department  Salary
0  60958ab26a84faa4745a6643  Jessica         IT    6000
1  60958ab26a84faa4745a6644   Joseph         IT    7000
2  60958ab26a84faa4745a6645     Alex   Accounts    5000
3  60958ab26a84faa4745a6646    Julie         IT    3000
4  60958ab26a84faa4745a6647    James      Admin    8000

In [7]:
df_department = pd.DataFrame(list(department.find()))

In [8]:
df_department.head()

                        _id  dep_name DepartmentHead
0  6095902dddd5b6fab2d303b8        IT          Jason
1  6095902dddd5b6fab2d303b9     Admin           Nial
2  6095902dddd5b6fab2d303ba  Accounts         Harris
3  6095902dddd5b6fab2d303bb  Analysis           Jack

### Left Join: 

Left join uses only keys from left frame, similar to a SQL left outer join

In [9]:
df_employees.merge(df_department,left_on="Department",right_on="dep_name",how="left")

,_id_x,name,Department,Salary,_id_y,dep_name,DepartmentHead
0,60958ab26a84faa4745a6643,Jessica,IT,6000,6095902dddd5b6fab2d303b8,IT,Jason
1,60958ab26a84faa4745a6644,Joseph,IT,7000,6095902dddd5b6fab2d303b8,IT,Jason
2,60958ab26a84faa4745a6645,Alex,Accounts,5000,6095902dddd5b6fab2d303ba,Accounts,Harris
3,60958ab26a84faa4745a6646,Julie,IT,3000,6095902dddd5b6fab2d303b8,IT,Jason
4,60958ab26a84faa4745a6647,James,Admin,8000,6095902dddd5b6fab2d303b9,Admin,Nial
5,60958ab26a84faa4745a6648,Jacob,Admin,9000,6095902dddd5b6fab2d303b9,Admin,Nial
6,60958ab26a84faa4745a6649,Kevin,IT,6500,6095902dddd5b6fab2d303b8,IT,Jason

### Inner Join: 

Use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys.

In [10]:
df_employees.merge(df_department,left_on="Department",right_on="dep_name",how="inner")

,_id_x,name,Department,Salary,_id_y,dep_name,DepartmentHead
0,60958ab26a84faa4745a6643,Jessica,IT,6000,6095902dddd5b6fab2d303b8,IT,Jason
1,60958ab26a84faa4745a6644,Joseph,IT,7000,6095902dddd5b6fab2d303b8,IT,Jason
2,60958ab26a84faa4745a6646,Julie,IT,3000,6095902dddd5b6fab2d303b8,IT,Jason
3,60958ab26a84faa4745a6649,Kevin,IT,6500,6095902dddd5b6fab2d303b8,IT,Jason
4,60958ab26a84faa4745a6645,Alex,Accounts,5000,6095902dddd5b6fab2d303ba,Accounts,Harris
5,60958ab26a84faa4745a6647,James,Admin,8000,6095902dddd5b6fab2d303b9,Admin,Nial
6,60958ab26a84faa4745a6648,Jacob,Admin,9000,6095902dddd5b6fab2d303b9,Admin,Nial

### To get the total number of records in the collection

In [11]:
pipeline = [
     {"$group": {"_id": None,"Count": {"$sum": 1}}}]
grp_employees = db.employees.aggregate(pipeline)

In [12]:
for employee in grp_employees:
  print(employee)

{'_id': None, 'Count': 7}

### To group by department and get the total salary for each department

In [13]:
pipeline = [
     {"$group": {"_id": "$Department","Salary": {"$sum": "$Salary"}}}]
grp_employees = db.employees.aggregate(pipeline)

In [15]:
for employee in grp_employees:
    print(employee)

{'_id': 'IT', 'Salary': 22500}
{'_id': 'Accounts', 'Salary': 5000}
{'_id': 'Admin', 'Salary': 17000}

### To group by department and get the average salary for each department

In [16]:
pipeline = [
    {"$group":{"_id":"$Department","Average Salary":{"$avg":"$Salary"}}}
]
grp_employees = db.employees.aggregate(pipeline)

In [17]:
for employee in grp_employees:
    print(employee['_id'],"\t Average Salary", employee['Average Salary'])

IT 	 Average Salary 5625.0
Accounts 	 Average Salary 5000.0
Admin 	 Average Salary 8500.0

### To get the employees with the lowest salary

In [18]:
pipeline = [
     {"$group": {"_id": None ,"Minimum Salary": {"$min": "$Salary"}}}]
grp_employees = db.employees.aggregate(pipeline)

In [19]:
for employee in grp_employees:
    for spec_emp in db.employees.find({"Salary":employee['Minimum Salary']}):
        print("Name ",spec_emp['name'],"\nSalary ",spec_emp['Salary'])

Name  Julie
Salary  3000